//執行時請用全螢幕 
#include<stdio.h>
#include<stdlib.h>
#include<conio.h>  			// 增加緩衝區資料 
int main(void)
{
	char number[4], letter; //宣告密碼字串(用陣列，在迴圈用得到)、變數 
	int i=0;                //宣告迴圈初始值 
	printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||* \n"); //個人介面 
	printf("*||                                                                                                                                      ||* \n");
	printf("*||                                                                                                                                      ||* \n");
	printf("*||                  __________________________                    |\\      /|                    __________________________              ||* \n");//印出反斜線的需求 
	printf("*||                  \\___                      \\                   | \\    / |                   /                      ___/              ||* \n");
	printf("*||                      \\__                    \\__                |  ----  |                __/                    __/                  ||* \n");
	printf("*||                         \\__                    \\               |        |               /                    __/                     ||* \n");
	printf("*||                            \\______              \\_____________/          \\_____________/       	  ______/                        ||* \n");
	printf("*||                                   \\__                                                              __/                               ||* \n");
	printf("*||                                      \\                                                            /                                  ||* \n");
	printf("*||                                       \\__                                                      __/                                   ||* \n");
	printf("*||                                          |                                                    |                                      ||* \n");
	printf("*||                                          |                                                    |                                      ||* \n");
	printf("*||                                          |                                                    |                                      ||* \n");
	printf("*||                                           \\_________                                _________/                                       ||* \n");
	printf("*||                                                     \\__                          __/                                                 ||* \n");
	printf("*||                                                        \\___                  ___/                                                    ||* \n");
	printf("*||                                                            \\__            __/                                                        ||* \n");
	printf("*||                                                               \\          /                                                           ||* \n");
	printf("*||            dddddddddddd                                        \\        /                              cccccccccccc                  ||* \n");
	printf("*||            dd          dd                                       \\      /                             cc            cc                ||* \n");
	printf("*||            dd           dd                                       \\    /                             cc              cc               ||* \n");
	printf("*||            dd            dd                                       \\  /                             cc                cc              ||* \n");
	printf("*||            dd             dd                                       \\/                             cc                                 ||* \n");
	printf("*||            dd             dd                                                                      cc                                 ||* \n");
	printf("*||            dd             dd                                                                      cc                                 ||* \n");
	printf("*||            dd            dd                                                                        cc                cc              ||* \n");
	printf("*||            dd           dd                                                                          cc              cc               ||* \n");
	printf("*||            dd         dd                                                                              cc           cc                ||* \n");
	printf("*||            ddddddddddd                                                                                  ccccccccccc                  ||* \n");
	printf("*||                                                                                                                                      ||* \n");
	printf("*||                                                                                                                                      ||* \n");
	printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||* \n");
	printf("*||                                                                                                                                      ||* \n");
	printf("*||                                                            E1B47 程式設計作業 1                                                      ||* \n");		
	printf("*||                                                                                                                                      ||* \n");
	printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||* \n");	
	printf("*||                                                                                                                                      ||* \n");
	printf("*||                                                            *按任意鍵以清除螢幕*                                                      ||* \n");
	printf("*||                                                                                                                                      ||* \n");
	printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||==||* \n");	
	getch();
	system("cls");                 //清除當前畫面 
	printf("正確密碼:2025\n ");
	printf("\n ");
	printf("輸入4個數字的號碼: ");
	while(i<=3)					   //輸入字元(指數字)直至i=3，印出*是為了密碼隱蔽性 
	{
		number[i]=getch();         // 輸入前請先檢查數字鍵盤的Num Lock是否解鎖 
		printf("*");               //每輸入一次字元，都會印出* 
		i++;
	}
	if(number[0]=='2' && number[1]=='0' && number[2]=='2' && number[3]=='5')//判斷密碼輸入是否正確 
	{
		printf("\n");
		printf("\n");		
		printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||*\n");
		printf("*||                                                  ||*\n");
		printf("*||                     歡迎回來!                    ||*\n"); 
		printf("*||                                                  ||*\n");
		printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||*\n");
		printf("*||                                                  ||*\n");
		printf("*||               *按任意鍵進入主選單*               ||*\n"); 
		printf("*||                                                  ||*\n");
		printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||*\n");
		getch();
		system("cls");
	}

	else
	{
		printf("\n");
		printf("\n");		
		printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||*\n");
		printf("*||                                                  ||*\n");
		printf("*||                    密碼錯誤!                     ||*\n"); 
		printf("*||                                                  ||*\n");
		printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||*\n");
		printf("%c",'\a');    //警告音 
		printf("\n");
		return 0; 
	}
	system("cls");

	printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||==||*\n");      //印出主選單 
	printf("*||                                                      ||*\n");
	printf("*||             A~Z           :         Uppercase        ||*\n"); 
	printf("*||                                                      ||*\n");
	printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||==||*\n");	
	printf("*||                                                      ||*\n");
	printf("*||             a~z           :         Lowercase        ||*\n"); 
	printf("*||                                                      ||*\n");
	printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||==||*\n");
	printf("*||                                                      ||*\n");
	printf("*||             0~9           :           Digit          ||*\n"); 
	printf("*||                                                      ||*\n");
	printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||==||*\n");	
	printf("*||                                                      ||*\n");
	printf("*||          Othercase        :         Your Name        ||*\n"); 
	printf("*||                                                      ||*\n");
	printf("*||==||==||==||==||==||==||==||==||==||==||==||==||==||==||*\n");	
	printf("\n ");
	printf("輸入一個字元: ");

	letter=getche();                  //輸入變數並保持顯示 
	if(letter>='A' && letter<='Z')    //判斷變數類型 
	{
		printf("\n");
		printf("\n");		
		printf("Uppercase\n");
		printf("\n");		
		printf("*按任意鍵以結束程式*\n");
		getch();
		return 0;		
	}		
	else if(letter>='a' && letter<='z')
	{
		printf("\n");
		printf("\n");
		printf("Lowercase\n");
		printf("\n");		
		printf("*按任意鍵以結束程式*\n");
		getch();
		return 0;		

	}
	else if(letter>='0' && letter<='9')
	{
		printf("\n");
		printf("\n");		
		printf("Digit\n");
		printf("\n");		
		printf("*按任意鍵以結束程式*\n");
		getch();
		return 0;		
	}	
	else
	{
		printf("\n");
		printf("\n");		
		printf("E1B47 宋哲銘\n");
		printf("\n");		
		printf("*按任意鍵以結束程式*\n");
		getch();
		return 0;		
	}		
}
/*	做完這次作業，我學會了很多東西。

	首先是cls的運用與緩衝區的結合，使執行時彷彿有切換畫面的動作。
		
	其次是密碼輸入，為了隱蔽性而印出*符號，我需要寫一個迴圈，使我的每一次輸入，每一個*符號都能代表我輸入的密碼。
	
	再者是if-else巢狀敘述，使我輸入單一字元時，進行字元類型的判斷。
	
	最後是getch、getche的運用，尤其是getch可以與迴圈結合，使達成密碼輸入的規格 
	
	我很高興能把這些技巧融會貫通，但我猜測，這次作業還只是個測試，因為這個作業要求可以升級成，用迴圈、switch敘述
		去無限次切換自行設計的數個選單，直至switch中的一項case，是用來終止程式。那當然，當有一個不符合程式要求的
		動作時，會被定義在default範圍中。要想做到這些東西，需要有縝密的思考流程，這也是我還在精進的部分。那怕我
		能夠順利完成這次作業，在做之前也費了我不少心思，甚至懷疑能不能做好這些東西，所以我依然覺得，"我還能在更好"。 */ 
